tap "homebrew/bundle"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Status bar application to enable/disable Yubikey Nano
cask "pallotron-yubiswitch"
# Text editor for code, markup and prose
cask "sublime-text"
mas "Goodnotes", id: 1444383602
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Reeder", id: 1529448980
mas "TickTick", id: 966085870
vscode "chiragpat.vscode-glimmer"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "stylelint.vscode-stylelint"
vscode "suchitadoshi1987.file-hopper"
vscode "typed-ember.glint-vscode"
vscode "wayou.vscode-todo-highlight"
