tap "homebrew/bundle"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
brew "tree"
mas "Magnet", id: 441258766
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "stylelint.vscode-stylelint"
vscode "suchitadoshi1987.file-hopper"
vscode "typed-ember.glint-vscode"
vscode "wayou.vscode-todo-highlight"
